# Project using Numpy and Pandas libraries in Python

In [48]:
# In this project , I am solving various questions to accomplish this project .
# for accomplish this project , I have

In [2]:
### importing numpy and pandas librries 
import numpy as np 
import pandas as pd

 Q-1) MegaCity Builders is a construction company. They seek the help of their data analyst 
   to generate employee codes from 1 to 1,000 for their part-time work force, 
   as they are not interested in the RDBMS solution.

In [4]:
megacity = pd.DataFrame()

In [5]:
megacity['empl_code'] = np.arange(1,1001)

In [6]:
megacity.head()

   empl_code
0          1
1          2
2          3
3          4
4          5

Q-2) 
 The company decides to give cash bonus to its employees on Christmas.  How can you generate the 
  random bonus amounts ranging from 100 USD to 300 USD for the 1,000 employees?

In [8]:
megacity['Bonus (USD)'] = np.random.randint(100,300,1000)

In [9]:
megacity.head()

   empl_code  Bonus (USD)
0          1          195
1          2          118
2          3          137
3          4          243
4          5          206

Q-3) 
MegaCity builders has a total of 1,000 part-time employees. The annual salary of these employees 
lies between 10,000 USD to 20,000 USD. The company wishes to find the average annual salary of employees.

In [11]:
megacity['Salary(USD)'] = np.random.randint(10000,20000,1000)

In [12]:
megacity.head()

   empl_code  Bonus (USD)  Salary(USD)
0          1          195        11237
1          2          118        14688
2          3          137        18194
3          4          243        17823
4          5          206        15047

In [14]:
avg_salary = megacity['Salary(USD)'].mean()
print(f"Average salary of all the employees of megacity is USD {avg_salary}")

Average salary of all the employees of megacity is USD 14992.269

 Q-4) Print the salaries of all the employees with the bonuses included.

In [15]:
megacity['Total_salary '] = megacity['Bonus (USD)'] + megacity['Salary(USD)']

In [16]:
megacity.head()

   empl_code  Bonus (USD)  Salary(USD)  Total_salary
0          1          195        11237          11432
1          2          118        14688          14806
2          3          137        18194          18331
3          4          243        17823          18066
4          5          206        15047          15253

Q-5) 
The HR of MegaCity Builders wishes to print those employee IDs that even number.

In [21]:
megacity[megacity['empl_code']%2 == 0]

     empl_code  Bonus (USD)  Salary(USD)  Total_salary
1            2          118        14688          14806
3            4          243        17823          18066
5            6          173        14020          14193
7            8          296        14109          14405
9           10          286        15522          15808
..         ...          ...          ...            ...
991        992          119        14799          14918
993        994          198        12800          12998
995        996          269        18446          18715
997        998          255        16855          17110
999       1000          225        13684          13909

[500 rows x 4 columns]

Q-6) 
 The company wishes to provide extra bonus of 200 USD to all the employees. How can you add 200 USD to each employee's bonus?

In [24]:
megacity['Bonus (USD)'] = megacity['Bonus (USD)'] + 200

In [25]:
megacity.head()

   empl_code  Bonus (USD)  Salary(USD)  Total_salary
0          1          395        11237          11432
1          2          318        14688          14806
2          3          337        18194          18331
3          4          443        17823          18066
4          5          406        15047          15253

 Q-7) 
 The HR wishes to know how many employees are getting salaries more than 15,000 USD per year.

In [32]:
grtr_15000 = megacity['Salary(USD)'][megacity['Salary(USD)']> 15000].count()
print(f"No. of employess who are getting salary greater tham 15000 USD are {grtr_15000}")

No. of employess who are getting salary greater tham 15000 USD are 485

In [33]:
# Q-8) 
## The employees with the codes 5, 124, 200, 332, 420, 589, 665, 743, 887, and 901 like to resign.
# As per the policy, the company does not save the data of part-time employees once they have resigned. 
#  How can you delete these record/data of employees? Consider the array "dup" to contain a copy of the employee codes.

In [49]:
# i = megacity['empl_code'][megacity.empl_code == 5].index

In [46]:
i

Int64Index([4], dtype='int64')